SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
/*-------------------------- CAN --------------------------------*/
#define MOTOR1_CAN_ID      0x1101E600UL
#define MOTOR2_CAN_ID      0x1201E600UL
#define MOTOR1_REPLY_ID    (MOTOR1_CAN_ID + 1UL)   /* 控制帧回码 */
#define MOTOR2_REPLY_ID    (MOTOR2_CAN_ID + 1UL)
#define MOTOR1_REPORT_ID   (MOTOR1_CAN_ID + 3UL)   /* 定时上报帧 */

#define MODE_SPEED         0x05
#define MODE_POSITION      0x06
#define CTRL_ENABLE        0x01
#define CTRL_DISABLE       0x02
#define CTRL_BRAKE         0x03

/* 故障码 (FOC_CH4-V1.2 第 11 页附表), 回码 DATA1 / 上报帧 DATA2 */
#define FOC_FAULT_NONE       0
#define FOC_FAULT_DRIVER     1
#define FOC_FAULT_OVERCURR   5
#define FOC_FAULT_OVERVOLT   6
#define FOC_FAULT_UNDERVOLT  7    /* 24V 电池带 36V 额定电机, 重点怀疑对象 */
#define FOC_FAULT_OVERTEMP   8
#define FOC_FAULT_HALL_M2    23
#define FOC_FAULT_HALL_M1    24
#define FOC_FAULT_STALL_M2   25
#define FOC_FAULT_STALL_M1   26
#define FOC_FAULT_UART       27
#define FOC_FAULT_RS485      28
#define FOC_FAULT_CAN        29

/*------------------ 命令帧的加减速斜坡 (DATA4 / DATA5) ------------
 *  驱动器文档原文: "当前转速为 0rpm, 目标 100rpm, 若设置间隔为 1ms,
 *  则目标转速值每 1ms 加 1, 直至 100rpm"。
 *  即 DATA4 的单位是 **ms / 每 1 RPM**, 范围 0~100, 0 = 阶跃(响应最快)。
 *
 *  ★ 现在改回 0 (阶跃)。原因:
 *    当初从 0 改成 3 是为了让起步柔和、少顶过流保护, 但**一直没做 A/B**。
 *    后来实测发现底盘直线会漂 (用户目测 2 米偏 40°, 约 20°/m), 而在更早
 *    (还是 ESP32 当上位机的年代) 的记录里是 7.4°/m —— 也就是变差了 2.7 倍。
 *    命令帧格式两代完全一致(厂商 Cmd_Vel_Callback 和自己写的 ESP32 发的
 *    是同一套 11 字节), CAN 重发周期也都是 20ms, **两代之间唯一的运动相关
 *    差异就是这个斜坡参数**。所以先把它改回 0, 把变量消掉再看。
 *
 *    如果改回 0 之后漂移没变化, 说明斜坡无关, 那就是驱动器速度环本身的
 *    问题(它确实在振荡: 目标 18RPM 时实际在 0~22 之间来回冲)。
 *    那时再把斜坡加回来也不迟 —— 它本来是为了柔顺, 不是为了准确。
 *
 *  减速保持 0: 要停就立刻停, 别拖泥带水(停车安全优先)。 */
#define ACCEL_STEP_MS      0
#define DECEL_STEP_MS      0

/*-------------------------- 协议 --------------------------------*/
#define CMD_FRAME_SIZE     11
#define CMD_HEAD           0x7B
#define TEL_FRAME_SIZE     24
#define TEL_HEAD           0x7B
#define TEL_TAIL           0x7D
#define DIAG_FRAME_SIZE    36
#define DIAG_HEAD          0x7E
#define DIAG_TAIL          0x7D

/* 命令帧里的功能码(f[1]), 沿用协议里"非速度帧靠功能码区分"的做法。
 * 协议已占用: 0x04 灯带 / 0x01 回充开关 / 0x00 安全防护, 0x05 是空的。 */
#define FUNC_RELAY         0x05     /* f[2] = 掩码: bit0 滚刷继电器 bit1 水泵继电器 */

/*-------------------------- 周期 --------------------------------*/
#define CAN_PERIOD_MS      20       /* 向电机重复发送的周期 */
#define ODOM_PERIOD_MS     20       /* 轮速采样/(可选)卡尔曼周期 (50Hz) */
#define TELEMETRY_PERIOD_MS 50      /* 上报周期 (20Hz) */
#define RPM_STALE_MS       200      /* 驱动器这么久没回码就认为转速无效 */

/*------------------- 轮速闭环修正 (外环 trim) ----------------------
 * 为什么需要:
 *   驱动器自己的速度环在小误差下给出的电流不足以快速突破静摩擦。实测原地
 *   转: 第 0 秒只有目标的 1%~26% —— **即使目标高达 43 RPM 也一样**; 而直线
 *   运动 0.07 秒就到 80%。同一个轮速区间表现差这么多, 所以这不是驱动器低速
 *   死区, 是原地转要克服轮胎刮擦/静摩擦。轮子是真的没转(不是空转打滑),
 *   所以把指令顶上去它就会转。
 *   STM32 这边原来是**纯开环**: 算完目标轮速直接发, 从不回读实际转速。
 *
 * ★ 第一版的教训 (已实测, 别重犯)
 *   第一版是"纯积分 + 绝对限幅 ±30 RPM + KI=1.5"。原地转的四秒总角度确实从
 *   41%~82% 提到了 85%~93%, 稳态也从 115% 回到了 101% —— 但代价是:
 *
 *   1. **绝对限幅在小名义值下会把指令顶成反向。** 原地转 wz=0.30 的名义轮速
 *      只有 13 RPM, 而修正量能到 -30, 于是 指令 = 13-30 = **-17 (轮子反转)**,
 *      车直接停住。直线 0.15 m/s (13.9 RPM) 更明显: 车中途往回走, 于是
 *      chassis_check 报出"后 40% 有 92% 但全程只有 26%"这种自相矛盾的数据。
 *      一个"修正"把自己修成了故障。
 *   2. **KI=1.5 太快, 和驱动器那个环组成慢速极限环。** 逐秒角速率变成
 *      过冲→塌陷→再爬: wz=1.00 是 0.43/1.73/0.90/0.54 (第 1 秒 173%)。
 *      积分增益和"被控对象滞后"的乘积大于 1 就会这样。
 *   3. 原注释里"输出永远落在普通全速命令能到的范围内"是**错的** ——
 *      MAX_RPM 是 200, 而 ±30 的绝对限幅在名义值 13 时已经把指令推到 2~3 倍。
 *
 * 第二版(现在)的三条改动, 逐条对症:
 *   a. **限幅改成按名义值的比例**(TRIM_UP_K / TRIM_DOWN_K), 不用绝对值。
 *      这样每种速度下行为一致, 而且反向最多只能减到名义值的一半 ——
 *      **修正量在任何情况下都不可能把指令的方向改掉**, 反转从机制上被消除。
 *   b. **KI 降到 0.6**, 让它只修稳态偏差, 不去和驱动器那个环抢动态。
 *   c. **起步助推 (kick) 单独做**, 见 KICK_*。突破静摩擦需要的是"立刻给力",
 *      而积分天生要"等误差攒起来"。把积分调快到能立刻给力, 它就会在轮子追上
 *      来之后迟迟不回, 造成上面那种过冲和振荡。两件事分开: 积分慢而稳只管
 *      稳态, 助推开环/定时/有界只管起步这一下 —— 开环所以不会构成第二个
 *      反馈回路, 也就不会振。
 *
 * 安全性(按"绝不引入新的失控模式"设计):
 *   1. 修正量按比例限幅(正向最多 +TRIM_UP_K 倍名义值, 反向最多 -TRIM_DOWN_K 倍),
 *      再受 TRIM_MAX_RPM 约束; 输出另受 MAX_RPM 约束。**净效果: 指令永远落在
 *      [1-TRIM_DOWN_K, 1+TRIM_UP_K] 倍名义值之内, 方向不变。**
 *   2. 目标为 0(停车/刹车/单轮不动)时修正量和助推一起清零, 不留历史。
 *   3. 驱动器回码不新鲜时不积分(只保持) —— 拿旧数据积分会把修正量喂到限幅。
 *   4. 修正量可从诊断帧推出(上报的"目标"是修正后的最终命令, 减去主机下发的
 *      理论目标就是修正量), 它有没有在乱冲一看便知。
 *=================================================================*/
/* ★ 第二版的实测结论(逐帧抓到了): 积分在**起步暂态**里把自己顶到限幅, 然后
 *   和驱动器的 PI 组成一个 0.25Hz 的极限环 —— `目标-理论` 那一列直接看得到:
 *       +7 -> +13(贴住限幅) -> +12 -> +9 -> +5 -> 0, 来回摆 ±14 RPM,
 *       周期 4~5 秒, 和速度振荡测出来的 0.25Hz 完全吻合。
 *   机制: 起步时轮子没转 -> 误差巨大 -> 积分顶到 +50% -> 指令 1.5 倍 ->
 *         驱动器本来就过冲 -> 实际冲到 52 RPM(名义 186%) -> 误差大幅反向 ->
 *         积分慢慢退回甚至摆到 -50% -> 指令 0.5 倍 -> 车慢下来 -> 积分又上去。
 *   而同一趟的**均值是 99%** —— 说明直行的稳态本来就不需要修, 积分没干好事。
 *
 * 所以第三版改三处, 都针对"别去积分它控制不了的暂态":
 *   a. **加线性带**(TRIM_LIN_BAND_RPM): 误差大于这个带就不积分。
 *      起步/被刮擦卡住时误差是 20~28 RPM, 落在带外 -> 完全不积分 ->
 *      从根上消掉那个 windup。轮子接近目标后才慢慢修稳态残差。
 *   b. **KI 0.6 -> 0.3**: 和外层拉开增益。驱动器里面已经有一个 PI 在管同一个
 *      误差, 两个积分器串在同一个误差上**必须拉开增益**, 否则必然振。
 *   c. **权限 ±50% -> ±20%**: 就算还有残余振荡, 幅度也被限在 ±20% 而不是
 *      ±50%(实测振幅就是限幅值本身)。稳态残差通常只有几个百分点, ±20% 够用。
 *
 * 助推(KICK)不动 —— 它只在起步 400ms 内起作用, 不在这个 0.25Hz 环里。 */
#define TRIM_ENABLE        1
#define TRIM_KI            0.3f     /* 每秒、每 1 RPM 偏差攒多少 RPM 修正 */
#define TRIM_UP_K          0.2f     /* 正向修正最多 +20% 名义值 */
#define TRIM_DOWN_K        0.2f     /* 反向修正最多 -20% 名义值 -> 永不反转 */
#define TRIM_MAX_RPM       20.0f    /* 绝对上限, 防高名义值下修正量过大 */
#define TRIM_LIN_BAND_RPM  5.0f     /* ★ 误差超过它就不积分(见上面第 a 条) */
#define TRIM_DEADBAND_RPM  0.5f     /* 目标小于这个就当"不该动", 全部清零 */

/* 起步助推: 目标从"不动"变成"要动"的瞬间, 额外给一段速度。
 * 专门用来突破静摩擦 —— 这是积分做不好也不该做的事(见上面第 c 条)。
 * 幅度取固定值而不是按名义值缩放: 要突破的是**摩擦力矩**, 它和你要跑多快
 * 没关系, 所以固定的一脚在低速档反而相对更有力, 正是需要的。
 *
 * ★ 助推必须"轮子一转起来就撤", 不能只靠定时。实测踩到: 助推只做了定时
 *   (固定 400ms), 结果原地转(真需要助推)没问题, 但**直线运动被助推害了** ——
 *   直线没有静摩擦问题, 轮子 0.06 秒就起来了, 此时还在助推就是纯超速:
 *   `decode --drive 0.30 0` 对应的稳态从 103% 变成 144%, 而 144% ≈ 名义值+助推,
 *   对得上。助推是给"卡住"用的, 所以判据应该是"轮子还没转起来", 不是"时间没到"。
 * 想 A/B 就把 KICK_RPM 改成 0。 */
#define KICK_RPM           12.0f    /* 助推幅度 (RPM) */
#define KICK_MS            400      /* 助推的硬上限时长(轮子一直没起来才用满) */
#define KICK_RELEASE_K     0.6f     /* 实际轮速达到名义值的这个比例就撤掉助推 */
#define KICK_REARM_MS      300      /* 目标归零后要静止这么久才允许再次助推 */

/*-------------------------- IMU --------------------------------*/
/* IMU 读一次大概 1~3ms(位翻转 I2C), 和轮速一起按 ODOM_PERIOD_MS 采样。
 *
 * ★ 协议要求上报的 IMU 原始值必须是 ±2g / ±500dps 量程下的值, 因为上位机
 *   是用固定系数换算的(MD 5.1 节):
 *       加速度: 原始值 / 1671.84    = m/s²
 *       陀螺仪: 原始值 * 0.00026644 = rad/s
 *   而 YbImu 的原始量程是 ±16g / ±2000dps, 所以这里必须换算 + 限幅。
 *   换错量程不会报错, 只会让上位机的数据全错。
 */
#define IMU_ACCEL_G_TO_RAW  (9.80665f * 1671.84f)   /* g      -> ±2g   原始值 */
#define IMU_GYRO_TO_RAW     (1.0f / 0.00026644f)    /* rad/s  -> ±500dps 原始值 */
#define IMU_GYRO_Z_SIGN     1       /* 陀螺 Z 轴方向; 见下面 IMU_Tick 里的用法 */

/*=========================== 全局状态 ==============================*/
volatile uint32_t g_tick_ms;

