SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
/*---------------------- 串口口 (就一个) ----------------------------*/
#define PORT_MAIN   0
#define PORT_COUNT  1

typedef struct
{
    uint8_t  id;
    USART_TypeDef *usart;
    uint8_t  ring[64];                  /* 接收环形缓冲 */
    volatile uint8_t head;
    volatile uint8_t tail;
    volatile uint8_t overflow;
    uint8_t  frame[CMD_FRAME_SIZE];     /* 组帧滑动窗口 */
    uint8_t  len;
    uint8_t  ok_count;
    uint8_t  bad_count;
} uart_port_t;

static uart_port_t ports[PORT_COUNT];

/* 目标 / 状态 */
static float    target_vx;          /* m/s */
static float    target_wz;          /* rad/s */
static uint8_t  ever_linked;
static uint8_t  failsafe_latched;

/* 两个驱动器是否都回过码 (bit0 = 1号, bit1 = 2号, 自开机起累计)。
 *
 * ★ 为什么需要: 差速车**只有一个轮子出力就等于原地打转**。实测出现过同一条
 *   直行命令连着发三次, 结果分别是"没反应"、"向左转"、"正常前进" ——
 *   直行变左转, 就是那一次只有一个驱动器响应了。
 *   所以策略: 没确认两个驱动器都活着之前, 只发刹车, 不发速度。见 Drive_Ready()。
 *
 * ★ 这里以前写的是"继电器合闸后等驱动器上电初始化" —— 那是错的:
 *   继电器管的是**滚刷和水泵**, 和轮毂驱动器没有关系(驱动器是常电的)。
 *   等待条件本身是对的, 错的是理由; 现在按真实理由重写。 */
static uint8_t drv_seen_mask;

/* 物理轮速目标 —— 上报给上位机, 用来和实际轮速对比(诊断"没劲"的关键) */
static int16_t  target_left_rpm;
static int16_t  target_right_rpm;

static uint32_t last_cmd_ms;        /* 最后一条**速度帧** (决定运动超时) */
static uint32_t last_frame_ms;      /* 最后一条**任何合法帧** (决定链路超时, 见看门狗) */
static uint32_t last_can_ms;
static uint32_t last_odom_ms;
static uint32_t last_tel_ms;

/* 诊断计数 */
static uint8_t  can_error_count;

/* 驱动器回码 (控制帧 ...E601 的应答, 每个字段来自同一帧, 时间戳共用 m*_rpm_ms) */
static volatile uint8_t m1_fault, m2_fault;     /* DATA1 故障码, 见 FOC_FAULT_* */
static volatile uint8_t m1_mode,  m2_mode;      /* DATA0 当前运行模式 0x05/0x06... */
static volatile int16_t m1_rpm,   m2_rpm;       /* DATA2/3 实际转速 RPM */
static volatile int16_t m1_cur,   m2_cur;       /* DATA4/5 输出扭矩电流, A x10 */
static uint32_t m1_rpm_ms, m2_rpm_ms;
static volatile uint16_t battery_mv;

/* 轮速计 */
static int16_t  wheel_left_rpm, wheel_right_rpm;   /* 已按接线校准的物理轮速 */
static uint8_t  wheel_left_fresh, wheel_right_fresh; /* 该轮回码是否新鲜 */
static float    body_vx, body_wz;                  /* 轮速正解出的车体速度 */

/* 外环修正状态 (物理轮速域, 左右各一份) —— 见 TRIM_* 的说明 */
typedef struct
{
    float    trim;          /* 积分修正量, RPM */
    uint32_t kick_until;    /* 起步助推的截止时刻 */
    uint32_t zero_since;    /* 目标从何时起为 0 (0 = 还没开始记) */
    uint8_t  armed;         /* 助推是否已武装 (1 = 下次目标非零时助推) */
} wheel_trim_t;

static wheel_trim_t trim_w[2];      /* [0] = 左轮, [1] = 右轮 */
#define TRIM_IDX_LEFT   0
#define TRIM_IDX_RIGHT  1

/* IMU (YbImu, 位翻转 I2C on PB10/PB11) */
static float    imu_accel_g[3];      /* 单位 g */
static float    imu_gyro[3];         /* 单位 rad/s */

/* IMU 诊断状态 —— 通过诊断帧上报, 方便查 I2C 接线/器件问题 */
static uint8_t  imu_ok;              /* 1 = 加速度有效 */
static uint8_t  imu_gyro_ok;         /* 1 = 陀螺仪有效(不是恒 0) */
static uint8_t  imu_status;          /* YBIMU_ST_* 失败原因 */
static uint8_t  imu_found_addr;      /* 扫描到的器件地址, 0 = 没扫到 */
static uint32_t imu_diag_ms;         /* 上次诊断的时刻 */

/* IMU 寄存器体检结果 (1Hz 刷一次)。
   陀螺仪恒 0 时靠它区分"只有陀螺仪坏"还是"整个模块只剩加速度可用"。 */
static uint8_t  imu_probe_flags;     /* bit0 版本 bit1 陀螺 bit2 磁力 bit3 四元数 bit4 欧拉 */
static uint8_t  imu_ver_major;
static int16_t  imu_euler_yaw_crad;  /* 模块自己融合的偏航角, 单位 0.01rad */
static uint32_t imu_probe_ms;        /* 上次寄存器体检的时刻 */

/* 上次复位是不是看门狗引起的 —— 是就说明主循环卡死过, 必须知道 */
static uint8_t  reset_by_iwdg;

/* 继电器 */
static uint8_t  relay_state;                       /* bit0 滚刷 bit1 水泵 */

/*=========================== 1ms 时基 ==============================*/
static void Tick_Init(void)
{
    TIM_TimeBaseInitTypeDef tim;
    NVIC_InitTypeDef nvic;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    tim.TIM_Prescaler = 7200 - 1;          /* 72MHz / 7200 = 10kHz */
    tim.TIM_CounterMode = TIM_CounterMode_Up;
    tim.TIM_Period = 10 - 1;               /* 10kHz / 10  = 1kHz -> 1ms */
    tim.TIM_ClockDivision = TIM_CKD_DIV1;
    tim.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM2, &tim);

    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    nvic.NVIC_IRQChannel = TIM2_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1;
    nvic.NVIC_IRQChannelSubPriority = 0;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);

    TIM_Cmd(TIM2, ENABLE);
}

void TIM2_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
    {
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
        g_tick_ms++;
    }
}

/*======================= 独立看门狗 (IWDG) =========================
 * ★ 为什么必须有它: 原来只有"软件看门狗" —— 在主循环里检查上位机多久没发
 *   命令。**但它本身也在主循环里**: 一旦主循环卡住(比如某处死等), 软件看门狗
 *   也跟着停, STM32 就再也不发 CAN 命令了。
 *
 *   而 FOC 驱动器**没有命令超时** —— 它会一直执行最后收到的那条命令。
 *   于是最坏情况是: 主循环卡死 -> STM32 静默 -> 驱动器保持最后的速度
 *   -> **车自己开走**。
 *
 *   IWDG 用的是芯片内部独立的 40kHz LSI(不受主时钟影响), 主循环卡住超过
 *   超时时间就强制复位 MCU。复位后 main() 会在 CAN 初始化完的第一时间发
 *   刹车帧, 车就停下了。
 *
 *   超时 = 预分频 / LSI * 重装值 = 64 / 40000 * 625 = 1.0 秒。
 *   (LSI 实际在 30~60kHz 之间飘, 所以真实超时约 0.67~1.33 秒, 够用。)
 *
 *   IWDG 一旦使能就**关不掉**, 只能靠复位。所以初始化放在这里、喂狗放主循环。
 *=================================================================*/
static void IWDG_Init(void)
{
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_64);   /* 40kHz / 64 = 625Hz */
    IWDG_SetReload(625);                    /* 625 / 625Hz = 1 秒 */
    IWDG_ReloadCounter();
    IWDG_Enable();
}

/*============================= CAN1 ================================*/
static void CAN1_Init(void)
{
    GPIO_InitTypeDef gpio;
    CAN_InitTypeDef can;
    CAN_FilterInitTypeDef filter;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

    gpio.GPIO_Pin = GPIO_Pin_12;               /* CAN1_TX */
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &gpio);

    gpio.GPIO_Pin = GPIO_Pin_11;               /* CAN1_RX */
    gpio.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &gpio);

    CAN_DeInit(CAN1);
    CAN_StructInit(&can);
    can.CAN_TTCM = DISABLE;
    can.CAN_ABOM = ENABLE;
    can.CAN_AWUM = ENABLE;
    can.CAN_NART = DISABLE;
    can.CAN_RFLM = DISABLE;
    can.CAN_TXFP = DISABLE;
    can.CAN_Mode = CAN_Mode_Normal;
    can.CAN_SJW = CAN_SJW_1tq;
    can.CAN_BS1 = CAN_BS1_8tq;
    can.CAN_BS2 = CAN_BS2_3tq;
    /* PCLK1 = 36MHz: 36 / 6 / (1 + 8 + 3) = 500 kbit/s */
    can.CAN_Prescaler = 6;
    CAN_Init(CAN1, &can);

    filter.CAN_FilterNumber = 0;
    filter.CAN_FilterMode = CAN_FilterMode_IdMask;
    filter.CAN_FilterScale = CAN_FilterScale_32bit;
    filter.CAN_FilterIdHigh = 0;
    filter.CAN_FilterIdLow = 0;
    filter.CAN_FilterMaskIdHigh = 0;
    filter.CAN_FilterMaskIdLow = 0;
    filter.CAN_FilterFIFOAssignment = CAN_Filter_FIFO0;
    filter.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&filter);
}

static void CAN1_SendRaw(uint32_t id, uint8_t dlc, const uint8_t *data)
{
    CanTxMsg tx;
    uint8_t mailbox;
    uint8_t status;
    uint8_t index;
    uint32_t timeout;

    tx.StdId = 0;
    tx.ExtId = id;
    tx.IDE = CAN_Id_Extended;
    tx.RTR = CAN_RTR_Data;
    tx.DLC = dlc;
    for (index = 0; index < 8; index++)
    {
        tx.Data[index] = (index < dlc) ? data[index] : 0;
    }

