SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
#if TRIM_ENABLE
    float mag;
    float up;
    float dn;

    mag = fabsf(nominal);

    /*---- 不该动: 修正、助推、计时全部清零, 不留任何历史 ----*/
    if (mag < TRIM_DEADBAND_RPM)
    {
        w->trim = 0.0f;
        w->kick_until = 0;

        /* 静止够久才重新武装助推。没这一条的话, 目标在 0 附近抖动
           (比如主机反复发 0.001 m/s) 会不停触发助推, 车一窜一窜的。 */
        if (w->armed == 0)
        {
            if (w->zero_since == 0)
            {
                w->zero_since = g_tick_ms;
            }
            else if ((g_tick_ms - w->zero_since) >= KICK_REARM_MS)
            {
                w->armed = 1;
                w->zero_since = 0;
            }
        }
        return 0.0f;
    }

    /*---- 目标从"不动"变成"要动": 起一次助推 ----*/
    if (w->armed)
    {
        w->armed = 0;
        w->zero_since = 0;
        w->kick_until = g_tick_ms + KICK_MS;
    }

    /*---- 助推的撤销: 轮子一旦真的转起来就立刻撤, 时间到只是兜底 ----
       原地转的轮子会被刮擦卡住(实际转速远低于名义值), 助推就一直给到超时;
       直线运动的轮子 0.06 秒就起来了, 助推马上就被撤掉, 不会造成超速。
       撤掉之后由积分接手, 不需要助推再参与。 */
    if (w->kick_until != 0)
    {
        if (fresh && (fabsf(actual) >= (mag * KICK_RELEASE_K)))
        {
            w->kick_until = 0;                      /* 已经转起来了 */
        }
        else if ((int32_t)(g_tick_ms - w->kick_until) >= 0)
        {
            w->kick_until = 0;                      /* 超时兜底 */
        }
        else
        {
            kick = KICK_RPM;
        }
    }

    /*---- 慢积分: 只修稳态偏差 ----
       ★ 只在**线性带内**积分。实测: 起步时轮子没转, 误差 20~28 RPM,
         积分会一路顶到限幅, 然后和驱动器的 PI 组成 0.25Hz 极限环
         (`目标-理论` 在 ±14 RPM 之间来回摆, 和速度振荡频率完全吻合)。
         误差超出这个带说明轮子"还没跟上", 那是助推和驱动器该管的事,
         外环不该在控制不了的暂态里攒积分。 */
    if (fresh)
    {
        float e = nominal - actual;
        if ((e < TRIM_LIN_BAND_RPM) && (e > -TRIM_LIN_BAND_RPM))
        {
            w->trim += TRIM_KI * e * dt;
        }
    }

    /*---- 限幅: 按名义值的比例, 不用绝对值 ----
       反向最多 -TRIM_DOWN_K 倍名义值, 所以指令的正负号永远不变。
       第一版用的是绝对 ±30 RPM, 在名义值只有 13 RPM 的原地转上把指令
       顶成了 13-30 = -17, 轮子反转、车停住 —— 比例限幅从机制上消除它。 */
    up = mag * TRIM_UP_K;
    dn = mag * TRIM_DOWN_K;
    if (up > TRIM_MAX_RPM) up = TRIM_MAX_RPM;
    if (dn > TRIM_MAX_RPM) dn = TRIM_MAX_RPM;
    if (w->trim >  up) w->trim =  up;
    if (w->trim < -dn) w->trim = -dn;

    out = nominal + w->trim;

    /* 助推按名义方向叠加 */
    if (kick > 0.0f)
    {
        out += (nominal > 0.0f) ? kick : -kick;
    }
#else
    (void)actual;
    (void)fresh;
    (void)dt;
    w->trim = 0.0f;
    w->kick_until = 0;
    out = nominal;
#endif

    out = ClampF(out, -(float)MAX_RPM, (float)MAX_RPM);

    /* ★ 最后一道保险: 修正 + 助推绝不允许把指令的方向改掉。
       名义为正就保证输出 >= 0, 名义为负就保证输出 <= 0。
       即使上面的限幅哪天被人改错了, 这一条也能兜住。 */
    if ((nominal > 0.0f) && (out < 0.0f)) out = 0.0f;
    if ((nominal < 0.0f) && (out > 0.0f)) out = 0.0f;

    return out;
}

/*===================== 驱动器就绪判断 ==============================
 * 差速车只有一个轮子出力就等于原地打转, 所以**没确认两个驱动器都活着之前,
 * 只发刹车、绝不发速度** —— 直行命令变成左转就是这么来的(见 drv_seen_mask)。
 *
 * 判据是两条, 都要满足:
 *   1. 两个驱动器**各自回过码**(证明 CAN 通、驱动器活着);
 *   2. 两路回码**现在都还新鲜** —— 用一次就够不算数, 半路掉线的驱动器必须
 *      立刻让车停下来, 否则又是一次"单轮驱动 = 原地打转"。
 *
 * 为什么不会死锁: 等待期间 Drive_Apply 每 20ms 发的是**刹车帧**, 而驱动器对
 * 刹车帧同样会回码, 所以回码一定会来。万一 CAN 真断了就一直刹车 ——
 * 这正是应该的结果(驱动器都没通, 本来就不该动)。
 *=================================================================*/
static uint8_t Drive_Ready(void)
{
    if ((drv_seen_mask & 0x03) != 0x03) return 0;             /* 有一路从没回过 */
    if ((g_tick_ms - m1_rpm_ms) > RPM_STALE_MS) return 0;     /* 1号现在不回了 */
    if ((g_tick_ms - m2_rpm_ms) > RPM_STALE_MS) return 0;     /* 2号现在不回了 */
    return 1;
}

/*========================= 差速逆解 ================================
 * 车体 (vx, wz) -> 左右轮目标转速。差速车用不到 vy。
 *   v_left  = vx - wz * b/2
 *   v_right = vx + wz * b/2
 *=================================================================*/
static void Drive_Apply(void)
{
    /* 外环积分用的真实周期。主循环里还夹着 IMU 读取(1~3ms)等开销, 实际周期
       会比 CAN_PERIOD_MS 略大; 用固定值会让 TRIM_KI 的实际含义随负载漂移,
       参数就没法标定了。异常值(第一次调用/计时器回绕/严重卡顿)兜底成标称值。 */
    static uint32_t last_trim_ms = 0;
    float dt = (float)(g_tick_ms - last_trim_ms) * 0.001f;

    float v_left = target_vx - target_wz * (TRACK_WIDTH_M * 0.5f);
    float v_right = target_vx + target_wz * (TRACK_WIDTH_M * 0.5f);
    float rpm_l = v_left / WHEEL_CIRC_M * 60.0f;
    float rpm_r = v_right / WHEEL_CIRC_M * 60.0f;
    float cmd_l;
    float cmd_r;
    int16_t m1;
    int16_t m2;

    if ((dt <= 0.0f) || (dt > 0.2f)) dt = (float)CAN_PERIOD_MS * 0.001f;
    last_trim_ms = g_tick_ms;      /* 就算下面提前 return 也要更新, 免得恢复时 dt 爆掉 */

    /* ★ 驱动器没都就绪: 只发刹车, 绝不发速度。
       差速车单轮出力 = 原地打转, 而实测真的出现过"直行命令变成向左转"。
       顺便把外环状态清零, 免得带着上一次攒的修正冲出去。 */
    if (!Drive_Ready())
    {
        trim_w[TRIM_IDX_LEFT].trim  = 0.0f;
        trim_w[TRIM_IDX_RIGHT].trim = 0.0f;
        trim_w[TRIM_IDX_LEFT].kick_until  = 0;
        trim_w[TRIM_IDX_RIGHT].kick_until = 0;
        target_left_rpm  = 0;
        target_right_rpm = 0;
        CAN1_SendStop(MOTOR1_CAN_ID);
        CAN1_SendStop(MOTOR2_CAN_ID);
        return;
    }

    rpm_l = ClampF(rpm_l, -(float)MAX_RPM, (float)MAX_RPM);
    rpm_r = ClampF(rpm_r, -(float)MAX_RPM, (float)MAX_RPM);

    /* 外环修正: 用实际轮速去修目标轮速。原地转起步时轮子是真的没转, 这里会把
       指令顶上去直到它真的转; 稳态偏高时又会把指令压回来。
       ★ 目标为 0 时 Trim_Apply 恒定返回 0, 而且它保证输出方向和名义值一致,
         所以外环**不可能**在主机下令停车的时候把车带着走, 也不可能把某个轮子
         修成倒转 —— 这是这套做法敢上车的底线。 */
    cmd_l = Trim_Apply(&trim_w[TRIM_IDX_LEFT], rpm_l,
                       (float)wheel_left_rpm, wheel_left_fresh, dt);
    cmd_r = Trim_Apply(&trim_w[TRIM_IDX_RIGHT], rpm_r,
                       (float)wheel_right_rpm, wheel_right_fresh, dt);

    /* 物理轮速 -> CAN 命令 (反向应用接线校准) */
    if (MOTOR1_IS_LEFT) { m1 = (int16_t)cmd_l; m2 = (int16_t)cmd_r; }
    else                { m1 = (int16_t)cmd_r; m2 = (int16_t)cmd_l; }
    if (MOTOR1_INVERT) m1 = (int16_t)(-m1);
    if (MOTOR2_INVERT) m2 = (int16_t)(-m2);

    /* 上报的是**最终真正发给驱动器**的物理轮速(含外环修正), 不是电机命令,
       免得左右概念混淆。主机拿自己下发的理论目标去减, 就是外环修正量。 */
    target_left_rpm  = (int16_t)cmd_l;
    target_right_rpm = (int16_t)cmd_r;

    /*===================== 走 / 停 两态 =====================
     * 停车就是一条 STOP_CTRL 帧, 每个控制周期重发。
     * 不切模式、不记忆状态、不引用位置 —— 出问题只可能出在电机或接线,
     * 不可能出在这几行逻辑上。这是上一版"位置锁位"失控后刻意保留的简单。
     *=======================================================*/
    if ((m1 != 0) || (m2 != 0))
    {
        CAN1_SendSpeed(MOTOR1_CAN_ID, m1);
        CAN1_SendSpeed(MOTOR2_CAN_ID, m2);
    }
    else
    {
        CAN1_SendStop(MOTOR1_CAN_ID);
        CAN1_SendStop(MOTOR2_CAN_ID);
    }
}

